app/Controllers/Apertura.php

SELECT *
FROM `aperturas`
WHERE `aperturas`.`id_apertura` = '1'
---
    public function editar($id_apertura)
    {
        $objApertura = new AperturasModel();
        $apertura = $objApertura->find($id_apertura);