app/Controllers/Bodega.php

    public function index()
    {
        try {
            $recursos = new RecursosModel();
            $bodegas = new BodegasModel();

            if((session()->isLoggedIn['nivel']==1) && (session()->isLoggedIn['estado_recurso']==1)){
                $data = [
                    'bodegas' => $bodegas->paginate(100),
                    'pager' => $bodegas->pager,
                    'usuarios' => $recursos->getRecursosResponsables()
                ];
            }else{
                $data = [
                    'bodegas' => $bodegas->where('recurso_username', session()->isLoggedIn['username'])->paginate(100),
                    'pager' => $bodegas->pager,
                    'usuarios' => $recursos->getRecursosResponsables()
                ];
---
SELECT *
FROM `bodegas`
 LIMIT 100
SELECT COUNT(*) AS `numrows`
FROM `bodegas`
SELECT *
FROM `bodegas`
WHERE `recurso_username` = 'cespedesvasquezfernando666@gmail.com'
 LIMIT 100
SELECT COUNT(*) AS `numrows`
FROM `bodegas`
WHERE `recurso_username` = 'cespedesvasquezfernando666@gmail.com'