app/Controllers/Producto.php

    public function index($id_bodega)
    {
        try {
            $producto = new ProductoModel();
            $unidad_medida = new UnidadesMedidaModel();
            $bodega = new BodegasModel();
            $miReferenciaPartida = new RangosPartidaModel();
            $referenciaPartida = $miReferenciaPartida->findAll();
            $control_expiracion = $bodega->getBodega($id_bodega);
            $productos = $producto->where('id_bodega', $id_bodega)->paginate(10000);
---
SELECT *
FROM `rangos_partida`
SELECT *
FROM `productos`
WHERE `id_bodega` = '1'
 LIMIT 10000
SELECT COUNT(*) AS `numrows`
FROM `productos`
WHERE `id_bodega` = '1'

    public function editar($id)
    {
        $producto = new ProductoModel();
        $prod=$producto->getProducto($id);
        $unidad_medida = new UnidadesMedidaModel();
        $bodega = new BodegasModel();
        $control_expiracion = $bodega->getBodega($prod['id_bodega']);

        $miReferenciaPartida = new RangosPartidaModel();
        $referenciaPartida = $miReferenciaPartida->findAll();
---
SELECT *
FROM `rangos_partida`