app/Controllers/Usuario.php

SELECT *
FROM `recursos`
 LIMIT 100
SELECT COUNT(*) AS `numrows`
FROM `recursos`
---
    public function index()
    {
        try {
            $recursos = new recursosModel();
                $data = [
                    'recursos' => $recursos->paginate(100),
                    'pager' => $recursos->pager,
                ];