app/Models/AdquisicionProductoModel.php

SELECT *
FROM `adquisicion_producto`
WHERE `id_bodega` = '1'
AND `id_producto` = '4595'
ORDER BY `id_adquisicion_producto` DESC
 LIMIT 1
---
	public function getAdquisicionesByIdProductoIdBodegaLastRow($id_bodega, $id_producto)
	{
        $query = $this->db->table($this->table)
						->where('id_bodega', $id_bodega)
						->where('id_producto', $id_producto)
						->orderBy('id_adquisicion_producto', 'DESC')
						->limit(1)
                        ->get();

SELECT SUM(`cant_ingreso`) AS `inicial`
FROM `adquisicion_producto`
WHERE `id_producto` = '4595'
AND `id_nro_adquisicion` = 1
---
	public function getSumaInicial($id_producto)
	{
        $query = $this->db->table($this->table)
                         ->selectSum('cant_ingreso','inicial')
						 ->where('id_producto', $id_producto)
						 ->where('id_nro_adquisicion',1)
                         ->get();

SELECT SUM(`ing_valorado`) AS `inicial_valorado`
FROM `adquisicion_producto`
WHERE `id_producto` = '4595'
AND `id_nro_adquisicion` = 1
---
	public function getSumaInicialValorado($id_producto)
	{
        $query = $this->db->table($this->table)
                         ->selectSum('ing_valorado','inicial_valorado')
						 ->where('id_producto', $id_producto)
						 ->where('id_nro_adquisicion',1)
                         ->get();

SELECT SUM(`cant_ingreso`) AS `ingresos`
FROM `adquisicion_producto`
JOIN `nro_adquisicion` ON `nro_adquisicion`.`id_nro_adquisicion` = `adquisicion_producto`.`id_nro_adquisicion`
WHERE `estado_nro_adquisicion` <> 2
AND `id_producto` = '4595'
AND `adquisicion_producto`.`id_nro_adquisicion` <> 1
AND MONTH(nro_adquisicion.fecha_adquisicion) = 10
---
	public function getSumaIngreso($id_producto, $mes)
	{
        $query = $this->db->table($this->table)
                         ->selectSum('cant_ingreso','ingresos')
						 ->join('nro_adquisicion', 'nro_adquisicion.id_nro_adquisicion = adquisicion_producto.id_nro_adquisicion')
						 ->where('estado_nro_adquisicion <>',2)
						 ->where('id_producto', $id_producto)
						 ->where('adquisicion_producto.id_nro_adquisicion <>',1)
						 ->where('MONTH(nro_adquisicion.fecha_adquisicion)', $mes) // Condición para el mes
                         ->get();

SELECT SUM(`ing_valorado`) AS `ing_valorado`
FROM `adquisicion_producto`
JOIN `nro_adquisicion` ON `nro_adquisicion`.`id_nro_adquisicion` = `adquisicion_producto`.`id_nro_adquisicion`
WHERE `estado_nro_adquisicion` <> 2
AND `id_producto` = '4595'
AND `adquisicion_producto`.`id_nro_adquisicion` <> 1
AND MONTH(nro_adquisicion.fecha_adquisicion) = 10
---
	public function getSumaIngresoValoradoProducto($id_producto, $mes)
	{
        $query = $this->db->table($this->table)
                         ->selectSum('ing_valorado','ing_valorado')
						 ->join('nro_adquisicion', 'nro_adquisicion.id_nro_adquisicion = adquisicion_producto.id_nro_adquisicion')
						 ->where('estado_nro_adquisicion <>',2)
						 ->where('id_producto', $id_producto)
						 ->where('adquisicion_producto.id_nro_adquisicion <>',1)
						 ->where('MONTH(nro_adquisicion.fecha_adquisicion)', $mes) // Condición para el mes
                         ->get();