app/Models/AperturasModel.php

	public function getAperturas()
	{
		return $this->findAll();
---
SELECT *
FROM `aperturas`