app/Models/BodegasModel.php

	public function getBodegasHabilitadas()
	{
		return $this->where('estado_bodega',1)->findAll();
---
SELECT *
FROM `bodegas`
WHERE `estado_bodega` = 1

	public function getBodegaByUsername($username)
	{
		$resultado = $this->where('recurso_username',$username)->limit(1)->findAll();
---
SELECT *
FROM `bodegas`
WHERE `recurso_username` = 'cespedesvasquezfernando666@gmail.com'
 LIMIT 1

	public function getBodegaById($id)
	{
		return $this->where('id_bodega', $id)->limit(1)->findAll();
---
SELECT *
FROM `bodegas`
WHERE `bodegas`.`id_bodega` = '1'