app/Models/PartidasModel.php

SELECT *
FROM `partida`
---
	public function getPartidas()
	{
		return $this->findAll();