app/Models/ProductoModel.php

	public function getProductosByIdBodega($id_bodega)
	{
		return $this->where('id_bodega',$id_bodega)->findAll();
---
SELECT *
FROM `productos`
WHERE `id_bodega` = '1'