app/Models/RecursosModel.php

	public function getRecursosResponsables()
	{
		return $this->asArray()->where(['estado_recurso'=>1, 'nivel'=>2])->findAll();
---
SELECT *
FROM `recursos`
WHERE `estado_recurso` = 1
AND `nivel` = 2

	public function getRecurso($username)
	{
		return $this->find($username);
---
SELECT *
FROM `recursos`
WHERE `recursos`.`username` = 'adrianalaura888@gmail.com'