app/Models/SubAperturasModel.php

	public function getAllSubAperturaByIdApertura($id_apertura)
	{
		return $this->where('id_apertura',$id_apertura)->findAll();
---
SELECT *
FROM `sub_aperturas`
WHERE `id_apertura` = '1'