app/Models/UnidadesMedidaModel.php

SELECT *
FROM `unidades_medida`
WHERE `id_bodega` = '1'
ORDER BY `nombre_unidad_medida` ASC
---
	public function getUnidadesBodega($id_bodega)
	{
		return $this->where('id_bodega',$id_bodega)->orderBy('nombre_unidad_medida', 'asc')->findAll();