app/Models/UsuarioAperturaModel.php

	public function getAperturaByUsername($username)
	{
		$resultado = $this->where('username',$username)->findAll();
---
SELECT *
FROM `usuario_apertura`
WHERE `username` = 'adrianalaura888@gmail.com'