app/Models/UsuarioBodegaModel.php

	public function getBodegaByUsername($username)
	{
		$resultado = $this->where('username',$username)->findAll();
---
SELECT *
FROM `usuario_bodega`
WHERE `username` = 'adrianalaura888@gmail.com'